{
  "course_name": "All You Need to Know About Prompt Engineering - Learn Interactively",
  "course_overview": "Prompt engineering means designing high-quality prompts that guide machine learning models to produce accurate outputs. It involves selecting the correct type of prompts, optimizing their length and structure, and determining their order and relevance to the task. \n\nIn this course, you’ll be introduced to prompt engineering, a form of generative AI. You’ll look at an overview of prompts and their types, best practices, and role prompting. Additionally, you’ll gain a detailed understanding of different prompting techniques. The course will also explore productivity prompts for different roles. Finally, you will learn to utilize prompts for personal use, such as preparing for interviews, etc. \n\nBy the end of the course, you will have developed a solid understanding of prompt engineering principles and techniques and will be equipped with the skills and knowledge to apply them in their respective fields. This course will help to stay ahead of the curve and take advantage of new opportunities as they arise.",
  "course_folder": "all you need to know about prompt engineering",
  "course_lessons": [
    "0-introduction to prompt engineering",
    "1-generative ai",
    "2-prompts and prompt engineering",
    "3-types of prompts",
    "4-prompt engineering best practices",
    "5-role prompting",
    "6-quiz introduction to prompt engineering",
    "7-zero shot prompting",
    "8-few shot prompting",
    "9-chain of thought prompting",
    "10-quiz techniques of prompting",
    "11-challenge techniques of prompting",
    "12-solution techniques of prompting",
    "13-productivity prompts overview",
    "14-enhancing english language skills",
    "15-empowering teachers",
    "16-spreadsheet expert",
    "17-empowering advertisers",
    "18-digital product creator",
    "19-human resources consultant",
    "20-social media manager",
    "21-seo specialist",
    "22-web developer",
    "23-saas product developer",
    "24-learning to code",
    "25-personal growth prompts overview",
    "26-interview preparation",
    "27-empowering students",
    "28-parenting aid",
    "29-social media youtuber twitter influencer instagram influencer",
    "30-freelancers",
    "31-concluding remarks"
  ],
  "repo_name": "plastic-resource"
}
